app/Models/UserModel.php

    public function findUserByCredentials($identifier, $password)
{
    $db = \Config\Database::connect();
    $builder = $db->table('users');
    $builder->select('id, username, email, password, friendly_name, role');
    $builder->where('username', $identifier);
    $builder->orWhere('email', $identifier);
    $query = $builder->get();
---
SELECT `id`, `username`, `email`, `password`, `friendly_name`, `role`
FROM `users`
WHERE `username` = 'filo@westerdrive.co'
OR `email` = 'filo@westerdrive.co'